#include<stdio.h>
#include<time.h>
#include<stdlib.h>
#include <string.h>

//int main()
//{
//	//%取模操作符两端必须是整数
//	int a = 7 % 2;          //1
//	int b = 7 / 2;          //3
//	printf("%d\n", a);
//	printf("%d\n", b);
//
//	return 0;
//}





//7
//00000000000000000000000000000111 - 原码
//00000000000000000000000000000111 - 反码
//00000000000000000000000000000111 - 补码

//-7
//10000000000000000000000000000111 - 原码
//11111111111111111111111111111000 - 反码
//11111111111111111111111111111001 - 补码

//整数在内存中存储的是补码




//int main()
//{
//	//移位操作符作用的是内存中的补码
//	int a = 7;                    
//	int b = a << 1;               
//	printf("a=%d\n", a);
//	printf("b=%d\n", b);
//
//
//
//	return 0;
//}

//int main()
//{
//	//移位操作符作用的是内存中的补码
//	int a = -7;
//	int b = a << 1;
//	printf("a=%d\n", a);
//	printf("b=%d\n", b);
//
//
//
//	return 0;
//}



//左移右移操作符只针对于整数，不能作用于浮点数


//int main()
//{
//	//移位操作符作用的是内存中的补码
//	int a = -7;
//	int b = a >> 1;
//
//	printf("a=%d\n", a);
//	printf("b=%d\n", b);
//
//
//
//	return 0;
//}


//   & - 按（二进制）位与
//   | - 按（二进制）位或
//   ^ - 按（二进制）位异或


////                             &
//int main()
//{
//	//00000000000000000000000000000011 - 原码
//	//00000000000000000000000000000011 - 反码
//	//00000000000000000000000000000011 - 补码
//	int a = 3;
//	//10000000000000000000000000000101 - 原码
//	//01111111111111111111111111111010 - 反码
//	//11111111111111111111111111111011 - 补码
//	int b = -5;
//	//00000000000000000000000000000011 - 补码       3
//	//11111111111111111111111111111011 - 补码      -5
//	int c = a & b;
//
//	
//
//	printf("c=%d\n", c);
//
//	return 0;
//}




////                             |
//int main()
//{
//	//00000000000000000000000000000011 - 原码
//	//00000000000000000000000000000011 - 反码
//	//00000000000000000000000000000011 - 补码
//	int a = 3;
//	//10000000000000000000000000000101 - 原码
//	//11111111111111111111111111111010 - 反码
//	//11111111111111111111111111111011 - 补码
//	int b = -5;
//	//00000000000000000000000000000011 - 补码       3
//	//11111111111111111111111111111011 - 补码      -5
//	int c = a | b;
//
//
//
//	printf("c=%d\n", c);
//
//	return 0;
//}



////                             ^
//int main()
//{
//	//00000000000000000000000000000011 - 原码
//	//00000000000000000000000000000011 - 反码
//	//00000000000000000000000000000011 - 补码
//	int a = 3;
//	//10000000000000000000000000000101 - 原码
//	//11111111111111111111111111111010 - 反码
//	//11111111111111111111111111111011 - 补码
//	int b = -5;
//	//00000000000000000000000000000011 - 补码       3
//	//11111111111111111111111111111011 - 补码      -5
//	int c = a ^ b;
//
//
//
//	printf("c=%d\n", c);
//
//	return 0;
//}



//不创建临时变量，实现两个数的交换


//int main()//简单思路，有缺陷，当两个数都很大，相加后会过界
//{
//	int a = 3;
//	int b = 5;
//
//	printf("交换前：a=%d b=%d\n", a, b);
//	a = a + b;
//	b = a - b;
//	a = a - b;
//	printf("交换后：a=%d b=%d\n", a, b);
//
//
//	return 0;
//}


//采用异或
//a ^ a = 0
//a ^ 0 = a
//遵循交换律，可实现两数交换



////在实际的开发过程中，异或速度没有第三变量快
//
//int main()
//{
//	int a = 3;
//	int b = 5;
//
//	printf("交换前：a=%d b=%d\n", a, b);
//	a = a ^ b;
//	b = a ^ b;
//	a = a ^ b;
//	printf("交换后：a=%d b=%d\n", a, b);
//
//
//	return 0;
//}


//int main()
//{
//	int a = -2;
//
//	printf("%d\n", ~a);
//	return 0;
//}
//
////加一取反

//int main()
//{
//	int a = 3;
////	int b = ++a;
//	int b = a++;
//	printf("%d\n", a);
//	printf("%d\n", b);
//
//	return 0;
//}


//*间接访问操作符（解引用操作符）
//int main()
//{
//	int a = 10;
//	int* p = &a;
//	//   '*'对p进行解引用，通过p里面存的地址，找到它所指向的对象
//	*p = 20;
//	printf("%d\n", a);
//
//	return 0;
//}



////(类型)强制类型转换
//int main()
//{
//	srand((unsigned int)time(NULL));//随机数
//	int a = (int)3.14;
//
//	printf("%d\n", a);
//
//
//	return 0;
//}


//int main()
//{
//	int a = 0;
//	printf("%d\n", sizeof(a));
//	printf("%d\n", sizeof(int));
//	printf("%d\n", sizeof a);
//	//printf("%d\n", sizeof int);
//
//
//
//	return 0;
//}
//
////sizeof是操作符，不是函数

//void text1(int arr[])
//{
//	printf("%d\n", sizeof(arr));
//}
//void text2(char ch[])
//{
//	printf("%d\n", sizeof(ch));
//}
//
//
//int main()
//{
//	int arr[10] = { 0 };
//	char ch[10] = { 0 };
//	printf("%d\n", sizeof(arr));
//	printf("%d\n", sizeof(ch));
//	text1(arr);
//	text2(ch);
//
//	return 0;
//}



//int main()
//{
//	if ("abc" == "abcdef")//这样写是来比较两个字符串首字符的地址
//	{
//		printf("qqq\n");
//	}
//
//	return 0;
//}


//
////&& 左边为假 右边就不计算了
////|| 左边为真 右边就不计算了
//
//
//int main()
//{
//	int i = 0, a = 0, b = 2, c = 3, d = 4;
//	i = a++ && ++b && d++;                   //遇到假的会停止运算后面的
//
//	//i = a++ || ++b || d++;
//
//	printf("a = %d\nb = %d\nc = %d\nd = %d\n",a,b,c,d);
//
//	return 0;
//}



////表达式1 ？ 表达式2 ：表达式3
////  真         对       错
////  假         错       对  
//int main()
//{
//	int a = 3;
//	int b = 0;
//	if (a > 5)
//	{
//		b = 3;
//	}
//	else
//	{
//		b = -3;
//	}
//
//	(a > 5) ? (b = 3) : (b = -3);
//
//	b = (a > 5 ? 3 : -3);
//
//	return 0;
//}

////逗号表达式
////由左向右依次执行，整个表达式的结果是最后一个表达式的结果
//
//
//int main()
//{
//	int a = 1;
//	int b = 2;
//	int c = (a > b, a = b + 10, a, b = a + 1);
//
//	printf("%d\n", c);
//
//
//	return 0;
//}

//int main()
//{
//	int arr[10] = { 0 };
//	arr[7] = 8;
//	7[arr] = 9;
//	//[]操作符，操作数是arr和7
//
//	//arr[7] --> *(arr+7)
//	//arr是数组首元素的地址
//	//arr+7就是跳过七个元素，指向了第八个元素
//	//*(arr+7)就是第八个
//
//
//	return 0;
//}




////函数调用操作符
//
//int main()
//{
//
//	int a = 10;
//	int b = 20;
//	//函数调用
//	int c = Add(a, b);//   ()就是函数调用操作符    操作数：Add，a,b
//	//sizeof a;    sizeof 后面省略了括号也可以，说明sizeof不是函数
//	return 0;
//}



struct Stu
{
	char name[20];
	int age;
	double score;
}; 

void set_stu(struct Stu* ps)
{
	/*strcpy_s((*ps).name,9,"zhangsan");
	(*ps).age = 20;
	(*ps).score = 100;*/

	strcpy_s(ps->name, 9,"zhansgan");
	ps->age = 20;
	ps->score = 100.0;
}

void printf_stu(struct Stu ss)
{
	printf("%s %d %lf\n", ss.name, ss.age, ss.score);
}
int main()
{
	struct Stu s = { 0 };
	set_stu(&s);
	printf_stu(s);

	return 0;
}